{
"review": "When I watched the first season when it was originally aired, it had some serious fan following, but I won't say it was very very famous at the time. Now, after the second season, seems everything has changed. Drastically the votings, rating, reviews have increased. IF one more season with similarly powerful characters, story comes out, then it surely would be among the greatest like 'Dexter', 'Breaking Bad' et cetera. I am confident it will go up to the seventh to set up a perfect finale in the next half decade.\n\nI did not review the first season, because I was not sure it would get better in the following season. I thought it was a one season thing. Now I'm here with awesome progression in the second season. I loved every episode. I've rated a few of them are out of out as they are well deserved. Firstly, for this to get better was the characters. A couple of new ones added. Not some sidekicks, but yes, they were with a stronger hold in the main narration.\n\nI loved Charlotte, the Lucifer's mother. That's the best thing happened here. Particularly the casting for it was the best pick. Tricia Helfer was like never seen before hot. The way the season ended was sad, if you had loved her. I hope she returns none other than as Charlotte in the future. Aimee Garcia was another highlitable cast. Her inclusion makes the crime fighting more interesting. She's a mini Dexter, without the dark desires.\n\nEach episode was unique, but the overall story flow was excellent, unlike the previous season where each episode has one crime to solve. Here too with the same style, but some time extended further for the next part. There was an aim for story to head, but the way it was presented was good. Shared it all throughout the season, while each episode had its own agenda. Lots of humours, as well as actions, adventures, suspense and a bit romantic.\n\nSo, if you haven't started, it's time to do so, because as I said it will be one of the best television programme on making that you should not miss while you have chance to follow from the beginning itself. All the actors were great, a well written and shot series. The season's finale and its final scene created more curiosity in me going to the third. I'm hoping for another magnificent season, which is due in a couple of months at the end of the year (2017). Highly recommended!"
}